app/Mail/UserRegistered.php

    public function __construct()
    {
        $this->agence = Agence::firstOrFail();
---
select * from `agences` limit 1